const { getTime } = global.utils;

module.exports = {
  config: {
    name: "warn",
    version: "1.8",
    author: "Mr.Smokey{Asif Mahmud}",
    countDown: 5,
    role: 0,
    description: {
      vi: "cảnh cáo thành viên trong nhóm, đủ 3 lần ban khỏi box",
      en: "warn member in group, if they have 3 warns, they will be banned",
      bn: "গ্রুপে সদস্যদের সতর্ক করুন, যদি কেউ ৩ বার সতর্ক হয় তাহলে তাকে গ্রুপ থেকে ব্যান করা হবে"
    },
    category: "box chat",
    guide: {
      vi: "{pn} @tag <lý do> ...",
      en: "{pn} @tag <reason> ...",
      bn: "{pn} @tag <কারণ>: সদস্যকে সতর্ক করুন"
    }
  },

  langs: {
    bn: {
      list: "সতর্ক হওয়া সদস্যদের তালিকা:\n%1\n\nসতর্ক বার্তার বিস্তারিত দেখতে "%2warn info [@tag | <uid> | ফাঁকা]" ব্যবহার করুন",
      listBan: "৩ বার সতর্ক হওয়া এবং গ্রুপ থেকে ব্যান হওয়া সদস্যদের তালিকা:\n%1",
      listEmpty: "আপনার গ্রুপে কেউ সতর্ক হয়নি",
      listBanEmpty: "আপনার গ্রুপে কেউ ব্যান হয়নি",
      invalidUid: "দয়া করে সঠিক uid প্রবেশ করুন",
      noData: "কোন তথ্য পাওয়া যায়নি",
      noPermission: "❌ কেবল অ্যাডমিনরা ব্যান তুলে দিতে পারে",
      invalidUid2: "⚠️ দয়া করে সঠিক uid দিন",
      notBanned: "⚠️ ইউজার %1 ব্যান নয়",
      unbanSuccess: "✅ সদস্য [%1 | %2] এর ব্যান সরানো হয়েছে",
      noPermission2: "❌ কেবল অ্যাডমিনরা সতর্কতা মুছতে পারে",
      invalidUid3: "⚠️ দয়া করে সঠিক uid বা ট্যাগ দিন",
      noData2: "⚠️ ইউজার %1 এর সতর্কতা তথ্য নেই",
      notEnoughWarn: "❌ ইউজার %1 এর মাত্র %2 সতর্কতা আছে",
      unwarnSuccess: "✅ [%2 | %3] সদস্যের %1 নম্বর সতর্কতা সফলভাবে মুছে ফেলা হয়েছে",
      noPermission3: "❌ কেবল অ্যাডমিনরা সতর্কতা ডেটা রিসেট করতে পারে",
      resetWarnSuccess: "✅ সতর্কতা ডেটা সফলভাবে রিসেট হয়েছে",
      noPermission4: "❌ কেবল অ্যাডমিনরা সদস্যকে সতর্ক করতে পারে",
      invalidUid4: "⚠️ দয়া করে যাকে সতর্ক করতে চান তাকে ট্যাগ করুন বা রিপ্লাই দিন",
      warnSuccess: "⚠️ সদস্যকে সতর্ক করা হয়েছে %2 বার
- ইউআইডি: %3
- কারণ: %4
- সময়: %5
এই সদস্য ৩ বার সতর্ক হয়েছে এবং ব্যান হয়েছে, ব্যান তুলতে "%6warn unban <uid>" ব্যবহার করুন",
      noPermission5: "⚠️ বটকে অ্যাডমিন করতে হবে ব্যান সদস্যকে রিমুভ করার জন্য",
      warnSuccess2: "⚠️ সদস্যকে সতর্ক করা হয়েছে %2 বার
- ইউআইডি: %3
- কারণ: %4
- সময়: %5
আরও %6 বার হলে ব্যান করা হবে",
      hasBanned: "⚠️ নিচের সদস্যগণ ইতিমধ্যে ৩ বার সতর্ক হয়েছে এবং ব্যান হয়েছে:\n%1",
      failedKick: "⚠️ নিচের সদস্যদের রিমুভ করতে সমস্যা হয়েছে:\n%1",
      userNotInGroup: "⚠️ ইউজার \"%1\" এখন গ্রুপে নেই"
    }
  }
};
